#include <stdio.h>
#include <Binary_Search.h>
#include <stdlib.h>
//การจัดการสต็อกสินค้า

// ตรวจสอบจำนวนสินค้า
// ตรวจสอบจำนวนสินค้าคงคลังของสินค้าแต่ละรายการ
// ตรวจสอบสินค้าที่ใกล้หมดสต็อก
void check_counting_stock(){}

// การแจ้งเตือนสินค้าคงคลัง: แจ้งเตือนเมื่อสินค้าใกล้หมดสต็อก
void stock_alert(){}

//การแจ้งเตือนวันที่ที่แต่ละ vender จะนำสินค้ามาลงในโกดังเรา เพื่อเป็นการบอก heads up ล่วงหน้า เพื่อให้เรา manage ว่าจะให้เขาลงสินค้ากี่ชิ้น เพื่อไม่ให้เกิดเหตุการณ์สินค้าล้นโกดัง ...or other incidents?
void noti_over_stock(){}
